# Используем официальный образ Node.js в качестве базового образа
FROM node:latest


####################################################
# Создаем рабочую директорию
WORKDIR /app
# Копируем файлы package.json
COPY package.json ./
####################################################



##################### Клиент ######################
# Переключаемся в директорию клиентской части
WORKDIR /app/client
# Копируем файлы package.json и package-lock.json для клиента
COPY client/package*.json ./
# Устанавливаем зависимости для клиента
RUN npm install
# Копируем папку build из клиентской части
COPY client/build ./build
####################################################



################### Сервер nestjs ####################
# Создаем рабочую директорию для серверной части
WORKDIR /app/nestjs
# Копируем файлы package.json и package-lock.json для сервера
COPY nestjs/package*.json ./
# Устанавливаем зависимости для серверной части
RUN npm install
# Копируем папку nestjs из серверной части
COPY nestjs/ ./
####################################################



####################################################
# Возвращаемся в корневую директорию проекта
WORKDIR /app
# Определяем порт, на котором будет работать приложение (только для информации)
EXPOSE 3001
CMD ["npm", "start"]
####################################################
